{
  "MESSAGES": {
    "SYS-SYS-E-0001": "Errore generico: {{error}}",
    "SYS-SYS-E-0002": "Errore di sistema: {{error}}",
    "SYS-SYS-E-0003": "Parametro obbligatorio non presente: {{parameter}}",
    "SYS-SYS-E-0004": "Parametro obbligatorio non presente o vuoto: {{parameter}}",
    "SYS-SYS-E-0005": "{{fieldname}} deve essere {{operator}} {{value}}",
    "SYS-SYS-E-0006": "{{entity}} non presente su sistema",
    "SYS-SYS-E-0007": "Accesso non permesso",
    "SYS-SYS-E-0008": "Errore di concorrenza",
    "SYS-SYS-E-0009": "Sono stati riscontrati i seguenti errori: {{errori}}",
    "SYS-SYS-E-0010": "Sono stati riscontrati degli errori durante l'elaborazione {{elaborazione_id}}",
    "SYS-SYS-P-0011-old": "L'elaborazione è stata presa in carico. L'esito sarà esposto nella pagina delle notifiche asincrone",
    "SYS-SYS-P-0011": "L'elaborazione è stata presa in carico. L'esito sarà esposto nella pagina di consulta programma",
    "SYS-SYS-E-0012": "Errore di sistema in fase di aggiornamento degli archivi. Riprovare.",
    "SYS-SYS-E-0013": "Non è stato possibile preparare il report. Riprovare.",
    "SYS-SYS-A-0014": "Si desidera cancellare i dati inseriti e ripristinare la situazione iniziale?",

    "PBA-ACQ-E-0000": "Indicare il CUI lavoro o altra acquisizione",
    "PBA-ACQ-P-0001": "È stato inserito l'acquisto con CUI: {{cui}}",
    "PBA-PRG-A-0002": "Sono presenti acquisti in Bozza. Si desidera cancellarli e confermare il programma?",
    "PBA-ACQ-E-0003": "L'acquisto non è stato inserito per i seguenti motivi: {{errors}}",
    "PBA-ACQ-P-0004": "Gli acquisti selezionati sono stati validati",
    "PBA-ACQ-E-0005": "Gli acquisti selezionati NON sono stati approvati: {{cui}}",
    "PBA-ACQ-E-0006": "L'acquisto con CUI: {{cui}} è stato modificato correttamente",
    "PBA-ACQ-E-0007": "L'acquisto non è stato cancellato",
    "PBA-ACQ-A-0008": "Si desidera cancellare l'acquisto/gli acquisti?",
    "PBA-ACQ-A-0009": "Si desidera validare l'/gli acquisto/sti selezionato/i ?",
    "PBA-ACQ-E-0010": "Gli acquisti selezionati non possono essere assegnati al nuovo RUP",
    "PBA-ACQ-A-0011": "Indicare almeno un importo",
    "PBA-ACQ-E-0012": "Occorre selezionare un programma",
    "PBA-ACQ-E-0013": "Non è possibile CANCELLARE l'acquisto selezionato",
    "PBA-ACQ-A-0014": "Si desidera procedere con l'annullamento degli acquisti selezionati?",
    "PBA-ACQ-E-0015": "",
    "PBA-ACQ-A-0016": "Tra gli acquisti selezionati l'operazione sarà applicata solo sugli acquisti non cancellati e su cui si può operare. Continuare con l'operazione?",
    "PBA-ACQ-P-0017": "L'operazione di validazione è avvenuta correttamente",
    "PBA-ACQ-E-0018": "Il CUI indicato non è valido",
    "PBA-ACQ-E-0019": "CUI non trovato",
    "PBA-ACQ-E-0020": "L'anno acquisto deve essere coerente con gli anni del programma",
    "PBA-ACQ-A-0021": "Tra gli acquisti selezionati si procederà a validare solo gli acquisti in stato VISTO e su cui si può operare. Continuare con l'operazione?",
    "PBA-ACQ-E-0022": "Il CUI lavoro o altra acquisizione indicato non è valido",
    "PBA-PRG-E-0023": "Non sono stati valorizzati i seguenti campi: {{errori}}",
    "PBA-PRG-P-0024": "È stato inserito il programma: {{prima_annualita}} - {{seconda_annualita}} vers. {{versione}}",
    "PBA-PRG-E-0025": "Non è possibile inserire il programma",
    "PBA-PRG-P-0026": "Il programma {{prima_annualita}} - {{seconda_annualita}} vers. {{versione}} è stato modificato correttamente",
    "PBA-PRG-E-0027": "L'operazione non è andata a buon fine per i seguenti motivi: {{errori}}",
    "PBA-PRG-A-0028": "Si desidera cancellare il programma?",
    "PBA-PRG-P-0029": "L'operazione di annullamento è avvenuta correttamente",
    "PBA-ACQ-P-0030": "L'operazione è stata effettuata con successo",
    "PBA-PRG-A-0031": "Si desidera confermare il programma?",
    "PBA-PRG-P-0032": "Il programma è stato confermato",
    "PBA-PRG-E-0033": "Sono presenti acquisti associati",
    "PBA-PRG-E-0034": "La prima annualità inserita non è valida",
    "PBA-PRG-E-0035": "Non è possibile approvare il programma poiché non è stato valorizzato il campo di mappa: url.",
    "PBA-PRG-E-0036": "Non è possibile cancellare un programma associato ad acquisti non cancellati. Occorre procedere prima alla cancellazione degli acquisti",
    "PBA-PRG-E-0037": "Il programma {{prima_annualita}} - {{seconda_annualita}} è stato già inserito",
    "PBA-ACQ-E-0038": "Non e' stato possibile copiare gli acquisti seguenti poiche' traslando gli importi la tabella degli importi risulterebbe tutta a 0,00. {{cui}}",
    "PBA-ACQ-E-0040": "Gli Acquisti selezionati sono stati già copiati per il biennio selezionato",
    "PBA-ACQ-E-0041": "I file sono vuoti",
    "PBA-ACQ-E-0042": "Il programma {{prima_annualita}} - {{seconda_annualita}} vers. {{versione}} non può essere inserito: la versione deve essere {{nuova_versione}}",
    "PBA-ACQ-E-0043": "Per l'anno {{anno}} mancano alcune versioni precedenti",
    "PBA-ACQ-E-0044": "Il referente indicato non è presente in archivio",
    "PBA-ACQ-E-0045": "Valore non valido nella riga {{riga}} colonna {{colonna}}",
    "PBA-PGR-A-0046": "Si desidera trasmettere i dati del programma selezionato e di tutti i suoi acquisti al Ministero? (Si ricorda che la scelta è definitiva)",
    "PBA-ACQ-E-0047": "File {{nome_file}}: Riga {{riga}} non valida, mancano dei campi",

    "PBA-ACQ-A-0048": "Si desidera apporre il visto sul/sugli acquisto/sti selezionato/i ?",
    "PBA-ACQ-A-0049": "Si desidera rifiutare l'/gli acquisto/sti selezionati?",
    "PBA-ACQ-A-0050": "Si desidera prendere in carico gli acquisti selezionati?",
    "PBA-ACQ-A-0051": "Si desidera volturare gli acquisti selezionati?",
    "PBA-ACQ-A-0052": "Si desidera apporre il visto e validare gli acquisti selezionati?",
    "PBA-ACQ-I-0053": "",
    "PBA-ACQ-A-0054": "Tra gli acquisti selezionati si procederà ad apporre il visto solo sugli acquisti in stato BOZZA e su cui si può operare. Continuare con l’operazione?",
    "PBA-ACQ-P-0055": "Tra gli acquisti selezionati l'operazione sarà applicata solo sugli acquisti in stato BOZZA oppure VISTO e su cui si può operare. Continuare con l'operazione?",
    "PBA-ACQ-E-0056": "",
    "PBA-ACQ-A-0057": "Tra gli acquisti selezionati si procederà a rifiutare solo quelli in stato VISTO e su cui si può operare. Continuare con l’operazione?",
    "PBA-ACQ-P-0058": "Gli acquisti selezionati sono stati presi in carico",
    "PBA-ACQ-E-0059": "Non è possibile prendere in carico nessuno tra gli Acquisti selezionati",
    "PBA-ACQ-A-0060": "Tra gli acquisti selezionati si effettuerà l’operazione di presa in carico solo su quelli non cancellati per cui non si è già il RUP. Continuare con l’operazione?",
    "PBA-ACQ-P-0061": "",
    "PBA-ACQ-E-0062": "",
    "PBA-ACQ-E-0063": "Non risulta alcun RUP disponibile (diverso da quello già assegnato)",
    "PBA-ACQ-E-0064": "Non è stato trovato alcun elemento valido",
    "PBA-ACQ-E-0065": "Le spese già sostenute non possono superare il totale dell’acquisto",
    "PBA-ACQ-E-0066": "Gli importi IVA non possono superare i totali dell’acquisto",
    "PBA-PRG-A-0067": "Si desidera riportare il programma in stato BOZZA?",
    "PBA-PRG-E-0068": "Esiste già un programma dello stesso biennio (con versione differente) in BOZZA",
    "PBA-PRG-A-0069": "Si desidera procedere con l’operazione di copia del programma?",
	  "PBA-PRG-E-0070": "Esiste già una versione del programma in bozza",

    "ORD-ORD-P-0001": "E’ stato inserito l’ordine {{anno}} / {{numero}} .",
    "ORD-ORD-E-0002": "La ricerca non è andata a buon fine per i seguenti motivi: {{errori}}",
    "ORD-ORD-E-0003": "Occorre indicare almeno un criterio di ricerca",
    "ORD-ORD-E-0004": "Soggetto non trovato",
    "ORD-ORD-E-0005": "Provvedimento non trovato",
    "ORD-ORD-E-0006": "Provvedimento non di competenza della struttura emittente, ma del settore {cdc}",
    "ORD-ORD-P-0007": "Operazione effettuata correttamente",
    "ORD-ORD-E-0008": "Settore non valido",
    "ORD-ORD-E-0009": "I dati dell’indirizzo del destinatario devono essere o tutti valorizzati o nessuno",
    "ORD-ORD-E-0010": "Non è stato trovato alcun elemento valido",
    "ORD-ORD-E-0011": "Codice CPV non valido",
    "ORD-ORD-E-0012": "Oggetto di spesa non valido",
    "ORD-ORD-E-0013": "Il codice CPV e l’oggetto di spesa sono incongruenti",
    "ORD-ORD-E-0014": "Unità di misura non valida",
    "ORD-ORD-E-0015": "Aliquota Iva non valida",
    "ORD-ORD-E-0016": "La differenza tra l’iva indicata e l’iva calcolata supera il parametro di tolleranza",
    "ORD-ORD-A-0017": "L’iva indicata e l’iva calcolata sono diverse, nei limiti del parametro di tolleranza. Si desidera comunque continuare con il salvataggio?",
    "ORD-ORD-E-0018": "La quantità deve essere maggiore di 0",
    "ORD-ORD-E-0019": "Il prezzo unitario deve essere maggiore di 0",

    "ORD-ORD-E-0021": "Gli impegni non sono validi",
    "ORD-ORD-E-0022": "Non è stato trovato alcun impegno",
    "ORD-ORD-E-0023": "È necessario associare almeno un impegno che abbia una disponibilità residua ad ordinare",
    "ORD-ORD-I-0024": "La riga è stata inserita, ma non è stato possibile inserire gli impegni. Controllare gli impegni associati all’ordine",
    "ORD-ORD-I-0025": "La disponibilità residua sugli impegni non è sufficiente: rimangono ancora da finanziare {{X}} euro",
    "ORD-ORD-E-0026": "Per alcuni impegni, la disponibilità residua ad ordinare non è sufficiente",
    "ORD-ORD-E-0027": "Non è possibile collegare sia impegni futuri che impegni di competenza/residui",
    "ORD-ORD-A-0028": "Il fornitore dell'ordine non è citato sugli impegni utilizzati: potrebbe essere presente una classe di soggetti; verificare i dati nel sistema contabile. Si desidera continuare con l'operazione?",
    "ORD-ORD-E-0029": "Il fornitore dell'ordine non è citato sugli impegni utilizzati. Non è possibile continuare con l'operazione",
    "ORD-ORD-E-0030": "Il destinatario relativo a questo settore esiste già",
    "ORD-ORD-E-0031": "La riga relativa all’oggetto di spesa indicato esiste già per questo destinatario",
    "ORD-ORD-A-0032": "Si vuole copiare le righe e (se presenti) i finanziari dal destinatario {{destinatario}}?",
    "ORD-ORD-E-0033": "Prima di confermare l’operazione, occorre selezionare un destinatario nell’elenco",
    "ORD-ORD-P-0034": "Le righe {progressivi} sono state scartate perché contengono elementi non validi. Per tutte le altre, l’operazione di copia è andata a buon fine",
    "ORD-ORD-E-0035": "L’operazione non è andata a buon fine: le righe del destinatario selezionato sono state tutte scartate perché contengono elementi non validi.",
    "ORD-ORD-P-0036": "L’operazione di copia è andata a buon fine, ma alcuni impegni non sono stati copiati, perché non validi o senza disponibilità ad ordinare. Verificare i dati.",
    "ORD-ORD-A-0037": "Si desidera eliminare gli impegni e subimpegni?",
    "ORD-ORD-A-0038": "Si desidera eliminare la riga?",
    "ORD-ORD-A-0039": "Si desidera eliminare il destinatario?",
    "ORD-ORD-A-0040": "Si desidera eliminare l’ordine: {{AnnoOrdine}} / {{NumeroOrdine}} ? ",
    "ORD-ORD-A-0041": "Si desidera annullare l’ordine {{AnnoOrdine}} / {{NumeroOrdine}} ? ",
    "ORD-ORD-E-0042": "Occorre indicare sia anno che numero ordine",
    "ORD-ORD-E-0043": "Nessun ordine trovato",
    "ORD-ORD-E-0044": "Ordine/i non di competenza dell’utente/settore emittente",
    "ORD-ORD-E-0045": "L’impegno indicato non è mai stato utilizzato negli ordini",
    "ORD-ORD-I-0046": "Tutti i controlli sull’ordine sono andati a buon fine",
    "ORD-ORD-E-0047": "L’ordine non è completo",
    "ORD-ORD-E-0048": "Il fornitore non è valido",
    "ORD-ORD-E-0049": "Il provvedimento di spesa non esiste",
    "ORD-ORD-E-0050": "Il settore emittente è stato chiuso",
    "ORD-ORD-E-0051": "Uno o più destinatari risultano chiusi",
    "ORD-ORD-E-0052": "Uno o più indirizzi indicati risultano chiusi",
    "ORD-ORD-E-0053": "Uno o più oggetti di spesa non sono più validi",
    "ORD-ORD-E-0054": "Le aliquote iva non sono più valide",
    "ORD-ORD-E-0055": "Le unità di misura non sono più valide",
    "ORD-ORD-E-0056": "Sono stati riscontrati problemi di disponibilità per i seguenti impegni: {{impegni}}",
    "ORD-ORD-E-0057": "Non sono state indicate le date di consegna sulla testata dell’ordine",
    "ORD-ORD-E-0058": "Non è stato indicato l’indirizzo unico di consegna o, in alternativa, gli indirizzi di consegna sui destinatari",
    "ORD-ORD-E-0059": "Per alcune righe, gli importi non coincidono con i totali indicati sugli impegni",
    "ORD-ORD-E-0060": "Per alcune righe, la differenza tra l’iva indicata e l’iva calcolata supera il parametro di tolleranza",
    "ORD-ORD-I-0061": "Per alcune righe, l’iva indicata e l’iva calcolata sono diverse, nei limiti del parametro di tolleranza. Si potrà comunque continuare con l’iter dell’ordine",
    "ORD-ORD-A-0062": "Tutti i controlli sono andati a buon fine. Si vuol procedere con la conferma dell’ordine?",
    "ORD-ORD-A-0063": "Tutti i controlli sono andati a buon fine. Si vuol procedere con l’autorizzazione dell’ordine?",
    "ORD-ORD-A-0064": "Il protocollo dell’ordine non è annullato. Si desidera comunque continuare con l’operazione di annullamento dell’ordine {{AnnoOrdine}} / {{NumeroOrdine}}?",
    "ORD-ORD-E-0065": "Il protocollo dell’ordine non è annullato. Impossibile continuare con l’operazione di annullamento dell’ordine.",
    "ORD-ORD-A-0066": "L'operazione di chiusura ordine è irreversibile. Si desidera veramente continuare?",
    "ORD-ORD-E-0067": "L’importo netto deve essere maggiore di 0.",
    "ORD-ORD-E-0068": "L’importo totale deve essere maggiore di 0",
    "ORD-ORD-E-0069": "L’oggetto di spesa non è presente nel listino fornitori. Al salvataggio della riga esso verrà inserito.",
    "ORD-ORD-E-0070": "Per ricercare un provvedimento di spesa, occorre indicarne anno e numero",
    "ORD-ORD-E-0071": "Per ricercare un impegno, occorre indicare anno esercizio, anno impegno e numero impegno",
    "ORD-ORD-E-0072": "Per ricercare un subimpegno, occorre indicare tutti i dati",
    "ORD-ORD-A-0073": "Per alcune righe, l’iva indicata e l’iva calcolata sono diverse, nei limiti del parametro di tolleranza. Si desidera procedere?",
    "ORD-ORD-E-0074": "Soggetto non trovato oppure non valido",
    "ORD-ORD-E-0075": "L’ordine non è autorizzato",
    "ORD-ORD-E-0076": "L’ordine non ha destinatari trasmessi a NSO",
    "ORD-ORD-E-0077": "L’ordine è già totalmente evaso",
    "ORD-ORD-E-0078": "L’ordine è collegato ad impegni futuri, non può essere ancora evaso",
    "ORD-ORD-P-0079": "E’ stata inserita l’evasione {{anno}} / {{numero}}.",
    "ORD-ORD-E-0080": "Occorre indicare sia anno che numero evasione",
    "ORD-ORD-E-0081": "Nessuna evasione trovata",
    "ORD-ORD-E-0082": "Evasione/i non di competenza dell’utente/settore emittente",
    "ORD-ORD-E-0083": "L’impegno indicato non è mai stato utilizzato nelle evasioni",
    "ORD-ORD-E-0084": "La somma dell’importo ripartito e dell’importo sospeso non deve superare il totale ripartibile",
    "ORD-ORD-E-0085": "Alcuni impegni sono stati indicati su più righe",
    "ORD-ORD-E-0086": "L’impegno {{anno}} / {{numero}} non è presente nel sistema contabile",
    "ORD-ORD-E-0087": "L’impegno {{anno}} / {{numero}} non è un impegno riaccertato dell’impegno {{anno-impegno-ordine}} / {{numero-impegno-ordine}}",
    "ORD-ORD-E-0088": "L’impegno {{anno}} / {{numero}} non è definitivo",
    "ORD-ORD-E-0089": "Per l’impegno {{anno}} / {{numero}} è stato superato il disponibile a liquidare",
    "ORD-ORD-E-0090": "I documenti trovati sono in uno stato non compatibile con l’aggancio degli ordini",
    "ORD-ORD-E-0091": "Documento non trovato",
    "ORD-ORD-E-0092": "Gli ordini citati nel documento non coincidono con gli ordini collegati all’evasione",
    "ORD-ORD-E-0093": "Il totale liquidabile del documento non coincide con il totale evaso",
    "ORD-ORD-E-0094": "Il fornitore dell’evasione e il fornitore della fattura non coincidono e non sono collegati",
    "ORD-ORD-E-0095": "Occorre indicare un importo da evadere su almeno una riga d’ordine",
    "ORD-ORD-E-0096": "Alcuni impegni/subimpegni indicati non sono compatibili con il fornitore della fattura collegata all’evasione",
    "ORD-ORD-A-0097": "Il fornitore della fattura non è citato sugli impegni utilizzati: potrebbe essere presente una classe di soggetti; verificare i dati nel sistema contabile. Si desidera continuare con l'operazione?",
    "ORD-ORD-A-0098": "Il fornitore dell’evasione e il fornitore della fattura non coincidono e non sono collegati. Si conferma il salvataggio?",
    "ORD-ORD-E-0099": "Data non valida",
    "ORD-ORD-A-0100": "Si desidera veramente ricercare un’altra fattura?",
    "ORD-ORD-E-0101": "Il totale evaso non può essere maggiore del totale liquidabile del documento",
    "ORD-ORD-E-0102": "Il totale evaso è maggiore del totale liquidabile e la differenza supera il parametro di tolleranza",
    "ORD-ORD-A-0103": "Il totale evaso è maggiore del totale liquidabile nei limiti del parametro di tolleranza: continuare con l’operazione?",
    "ORD-ORD-E-0104": "L’evasione non è completa: verificare che sia stata collegata una fattura e che ogni destinatario abbia almeno una riga ed un impegno collegati",
    "ORD-ORD-E-0105": "Alcuni impegni non sono definitivi",
    "ORD-ORD-E-0106": "Per alcun impegni è stato superato il disponibile a liquidare",
    "ORD-ORD-A-0107": "Tutti i controlli sono andati a buon fine. Si vuol procedere con l’autorizzazione dell’evasione?",
    "ORD-ORD-E-0108": "Lo stato della fattura collegata all’evasione non è compatibile con l’aggancio degli ordini",
    "ORD-ORD-A-0109": "Si vuol procedere con l’invio degli impegni in contabilità?",
    "ORD-ORD-A-0110": "Si desidera cancellare l’evasione: {{anno}} / {{numero}} ?",
    "ORD-ORD-A-0111": "Si desidera annullare l’evasione: {{anno}} / {{numero}} ?",
    "ORD-ORD-A-0112": "Il documento collegato è annullato. L'evasione sarà annullata. Si vuole continuare con l'operazione di annullamento?",
    "ORD-ORD-A-0113": "L'evasione sarà annullata ma, prima di reinserirne una nuova, occorre verificare la fattura sul sistema contabile e cancellare gli eventuali impegni sulle quote ad essa collegate. Si desidera continuare con l'operazione?",
    "ORD-ORD-E-0114": "Non è possibile annullare l’evasione; occorre prima andare a cancellare gli impegni sul documento nel sistema contabile",
    "ORD-ORD-E-0115": "Non è possibile eliminare l’unica riga del destinatario",
    "ORD-ORD-E-0116": "Non è possibile eliminare l’unico destinatario dell’evasione",
    "ORD-ORD-E-0117": "L’ordine non ha destinatari da chiudere",
	  "ORD-ORD-E-0118": "Ci sono ancora delle evasioni collegate all’ordine che non hanno concluso il loro ciclo"
  },
  "DATEPICKER": {
    "WEEKDAYS": ["Lu", "Ma", "Me", "Gi", "Ve", "Sa", "Do"],
    "MONTHS_SHORT": ["Gen", "Feb", "Mar", "Apr", "Mag", "Giu", "Lug", "Ago", "Set", "Ott", "Nov", "Dic"],
    "MONTHS_LONG": ["Gennaio", "Febbraio", "Marzo", "Aprile", "Maggio", "Giugno", "Luglio", "Agosto", "Settembre", "Ottobre", "Novembre", "Dicembre"]
  }
}
